geonetwork-teamengine-ebrim/testdata/SoapDescriberRecord.xml

<?xml version="1.0"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
	<env:Header>
	</env:Header>
	<env:Body>
		<csw:DescribeRecord 
			xmlns:tns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" 
			xmlns:csw="http://www.opengis.net/cat/csw/2.0.2"
			outputFormat="application/xml" 
			schemaLanguage="http://www.w3.org/2001/XMLSchema" 
			service="CSW" 
			version="2.0.2">
			<csw:TypeName>Record</csw:TypeName>
		</csw:DescribeRecord>
	</env:Body>
</env:Envelope>


